---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.FlexDuctType
source: html/746b22f4-8be9-2520-9f19-0011459eb000.htm
---
# FlexDuctType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.